################################################################
# setup (required)                                             #
################################################################

# homebrew taps #
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
# tap "homebrew/services"

# mac app store installer #
brew "mas"

################################################################
# core formulae                                                #
################################################################

# cli #
brew "autojump"                 # recent directory hopper
brew "bat"                      # cat alternative
brew "direnv"                   # directory level envs
brew "dotbot"                   # dotfile manager
# brew "eget"                     # pre-built binary installer
brew "exa"                      # ls alternative
# brew "fzf"                      # cli fuzzy finder
brew "gh"                       # github cli
brew "git"                      # version control system
brew "glow"                     # terminal markdown viewer
brew "httpie"                   # rest client
brew "just"                     # project specific commands
brew "macchina"                 # system info
brew "m-cli"                    # macos cli
brew "noti"                     # trigger macos notifications
# brew "pandoc"                   # markup document converter
brew "pastel"                   # color manipulation
brew "pipx"                     # globally isolated pip installs
brew "podman"                   # containerization
brew "scc"                      # lines of code counter
brew "starship"                 # cross-shell prompt
brew "tldr"                     # community driven man pages
brew "travis"                   # travis ci cli
brew "yank"                     # terminal clipboard utility
brew "zsh"                      # updated z shell
brew "zsh-autosuggestions"      # zsh autosuggestions
brew "zsh-syntax-highlighting"  # zsh syntax highlighting

# dev #
# brew "asdf"                     # runtime version manager
# brew "cocoapods"                # native apple development
# brew "deno"                     # js/ts runtime
brew "fnm"                      # nodejs version manager
# brew "nodenv"                   # nodejs version manager
brew "pnpm"                     # nodejs package installer
# brew "postgresql"               # postgres DB
brew "pyenv"                    # python version manager
# brew "rbenv"                    # ruby version manager
brew "rustup-init"              # rust toolchain installer
# brew "vercel-cli"               # deployments and hosting
# brew "vue-cli"                  # vue.js tooling cli

################################################################
# casks                                                        #
################################################################

# apps #
cask "aldente"                  # battery manager ($?)
cask "appcleaner"               # app uninstaller
cask "bartender"                # menu bar organizer ($)
cask "cleanshot"                # screen captures ($)
# cask "codeedit"                 # editor (not yet available)
cask "commandq"                 # delayed app quits ($)
# cask "cryptomator"              # cloud data encryption
cask "daisydisk"                # disk space visualizer ($)
cask "devutils"                 # dev utility suite ($)
cask "discord"                  # digital communities
cask "eloston-chromium"         # ungoogled chromium browser
cask "eul"                      # menu bar system stats
cask "fig"                      # terminal autocomplete
cask "firefox"                  # web browser
cask "geekbench"                # system benchmarking
cask "github"                   # git client
# cask "hazel"                    # file automation ($$)
# cask "httpie"                   # rest client (not yet available)
cask "hush"                     # safari content blocker
cask "hyper"                    # terminal emulator
cask "keka"                     # archive handler
cask "kekaexternalhelper"       # keka helper
cask "linear-linear"            # issue tracker
cask "mactracker"               # apple product info
cask "numi"                     # notepad calculator ($?)
# cask "obs"                      # streaming suite
cask "obsidian"                 # markdown knowledge base
cask "podman-desktop"           # containerization
cask "protonmail-bridge"        # proton.me local IMAP bridge
cask "raspberry-pi-imager"      # pi boot drive imager
cask "raycast"                  # spotlight replacement
cask "rectangle"                # window management
cask "signal"                   # encrypted messaging
# cask "spacedrive"               # file database (not yet available)
cask "spotify"                  # music and podcasts
cask "todoist"                  # task tracker
# cask "utm"                      # virtual machines
cask "vscodium"                 # editor
# cask "warp"                     # terminal emulator

# dev #
cask "temurin"                  # jdk
cask "trunk-io"                 # devex lint and merge toolset

# games #
cask "minecraft"                # minecraft launcher
# cask "openemu"                  # game emulator
# cask "retroarch"                # game emulator

################################################################
# cask-drivers                                                 #
################################################################

# cask "elgato-game-capture-hd"   # elgato peripheral suite
cask "logitech-options"         # logitech peripheral manager
# cask "sonos"                    # sonos sound system manager

################################################################
# cask-fonts                                                   #
################################################################

cask "font-cascadia-code"
# cask "font-caskaydia-cove-nerd-font"
cask "font-camingocode"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-inter"

################################################################
# mas                                                          #
################################################################

# apps #
mas "canary-mail", id: 1236045954   # email client ($)
mas "color-picker", id: 1545870783  # color picker
mas "dashlane", id: 517914548       # password manager ($)
mas "duckduckgo", id: 1482920575    # safari tracker blocker
mas "magic-lasso", id: 1198047227   # safari ad blocker
mas "numbers", id: 409203825        # spreadsheets
mas "parcel", id: 639968404         # package tracking
mas "peek", id: 1554235898          # quicklook enhancer ($)
mas "twitter", id: 1482454543       # social feed

# dev #
mas "xcode", id: 497799835          # apple ide

################################################################
# custom taps                                                  #
################################################################

tap "boldandbrad/homebrew-tap"
brew "makey-cli"                    # cli passkey maker

cask "hpedrorodrigues/tools/dockutil"  # macOS dock manager (temporary cask tap due to issues with official formula)

tap "snyk/tap"
brew "snyk"                       # code vulnerability scanner

tap "superatomic/bundle-extensions" # additional brew commands

tap "teamookla/speedtest"
brew "speedtest"                    # cli internet speed tester

tap "zero-sh/tap"
brew "apply-user-defaults"          # macos defaults installer

################################################################
# new additions (via "brew add")                               #
################################################################

