################################################################
# Brewfile - macOS software installs                           #
################################################################
# Packages and apps to be installed / updated via Homebrew.    #
# Be sure to remove / comment out tools you do not need.       #
################################################################

################################################################
# options                                                      #
################################################################

# cask_args appdir: '~/Applications', require_sha: true

################################################################
# taps (homebrew/core and homebrew/cask are auto-tapped)       #
################################################################

tap "homebrew/bundle"                 # brewfile commands
tap "homebrew/services"               # system services

tap "boldandbrad/tap"                 # stuff made by me :)
tap "jandedobbeleer/oh-my-posh"       # oh my posh shell prompt
tap "superatomic/bundle-extensions"   # extra brew commands

################################################################
# terminal apps and packages                                   #
################################################################

brew "bash"                     # system bash replacement
brew "bat"                      # cat replacement
brew "boldandbrad/tap/meeple-cli" # board game collection manager
brew "btop"                     # system monitor
brew "dockutil"                 # dock manager
brew "dust"                     # disk space analyzer
brew "eza"                      # ls replacement
brew "fastfetch"                # system info fetcher
brew "fzf"                      # fuzzy finder
brew "git"                      # version control system
brew "glow"                     # markdown viewer
brew "jq"                       # json processor
brew "lazygit"                  # git client
brew "neovim"                   # text editor
brew "oh-my-posh"               # cross-shell prompt engine
brew "pastel"                   # color manipulator
brew "ripgrep"                  # grep alternative
brew "tailspin"                 # log file highlighter
brew "tlrc"                     # concise man page client
brew "tmux"                     # terminal multiplexer
# brew "vhs"                      # session recorder
# brew "viddy"                    # watch alternative
brew "xdg-ninja"                # home dir cleaner
brew "yank"                     # clipboard utility
brew "yazi"                     # file manager
brew "zoxide"                   # cd replacement
brew "zsh"                      # system zsh replacement

################################################################
# desktop apps                                                 #
################################################################

cask "alacritty"                # terminal emulator
cask "arc"                      # web browser
# cask "balenaetcher"             # boot drive imager
cask "bricklink-studio"         # lego moc designer
cask "discord"                  # digital community client
cask "duckduckgo"               # web browser
cask "keka"                     # archive handler
cask "kekaexternalhelper"       # keka helper
cask "mactracker"               # apple product info
# cask "obs"                      # streaming suite
cask "obsidian"                 # markdown note manager
cask "proton-drive"             # cloud file storage client
cask "proton-mail"              # email client
cask "proton-pass"              # password manager
cask "protonvpn"                # vpn client
# cask "raspberry-pi-imager"      # pi boot drive imager
cask "raycast", args: { require_sha: false } # spotlight replacement
cask "spotify", args: { require_sha: false } # audio streamer
cask "syntax-highlight"         # quicklook syntax highlighter
cask "vscodium"                 # text editor
cask "wezterm"                  # terminal emulator

################################################################
# software development tooling and apps                        #
################################################################

brew "deno"                     # js/ts runtime & toolchain
brew "elm"                      # elm-lang compiler & toolchain
brew "exercism"                 # cli coding exercise client
brew "gh"                       # cli github client
brew "go"                       # golang compiler & toolchain
# brew "gradle"                   # java build tool
cask "httpie"                   # desktop http client
brew "podman"                   # cli container client
cask "podman-desktop"           # desktop container client
# brew "postgresql"               # postgres DB
brew "pre-commit"               # git hook manager
brew "rustup"                   # rust toolchain installer
cask "temurin"                  # jdk
brew "tokei"                    # code line counter
brew "uv"                       # python toolchain
# cask "vagrant"                  # virtual env manager
# brew "vercel-cli"               # deployments and hosting

################################################################
# fonts                                                        #
################################################################

cask "font-anonymous-pro"
cask "font-anonymice-nerd-font"
# cask "font-cascadia-code"
# cask "font-caskaydia-cove-nerd-font"
# cask "font-fira-code"
# cask "font-fira-code-nerd-font"

################################################################
# games                                                        #
################################################################

brew "fabric-installer"         # minecraft mod loader
# brew "ferium"                   # minecraft mod manager
cask "minecraft"                # minecraft launcher
# cask "modrinth"                 # minecraft launcher & mod manager
# cask "retroarch"                # game emulator launcher
cask "steam"                    # game marketplace and launcher

################################################################
# new additions (via "brew add")                               #
################################################################
