################################################################
# Brewfile - macOS software installs                           #
################################################################
# Packages and apps to be installed / updated via Homebrew.    #
# Be sure to remove / comment out tools you do not need.       #
################################################################

################################################################
# options                                                      #
################################################################

# cask_args appdir: '~/Applications', require_sha: true

################################################################
# taps (homebrew/core and homebrew/cask are auto tapped)       #
################################################################

tap "homebrew/cask-fonts"             # fonts
tap "homebrew/bundle"                 # brewfile commands
tap "homebrew/services"               # system services

tap "boldandbrad/tap"                 # stuff made by me :)
tap "oven-sh/bun"                     # bun tools
tap "pkgxdev/made"                    # pkgx tools
tap "superatomic/bundle-extensions"   # extra brew commands

################################################################
# packages & command line tools                                #
################################################################

brew "antidote"                 # zsh plugin manager
brew "asciinema"                # terminal session recorder
brew "bash"                     # updated bash
brew "bat"                      # cat replacement
brew "boldandbrad/tap/meeple-cli" # board game collection manager
brew "direnv"                   # directory level envs
brew "dust"                     # disk space analyzer
brew "eza"                      # ls replacement
brew "fcp"                      # cp replacement
brew "fzf"                      # terminal fuzzy finder
brew "git"                      # version control system
brew "git-delta"                # git diff pager and highlighter
brew "glow"                     # terminal markdown viewer
brew "jq"                       # json processor
brew "just"                     # project specific commands
brew "mas"                      # mac app store installer
brew "neofetch"                 # system info viewer
brew "neovim"                   # tui editor
brew "pastel"                   # color manipulation
brew "ripgrep"                  # grep alternative
# brew "rm-improved"              # rm alternative
brew "starship"                 # cross-shell prompt
brew "tailspin"                 # log file highlighter
brew "tlrc"                     # tldr client: concise man pages
brew "tmux"                     # terminal multiplexer
# brew "viddy"                    # watch alternative
brew "xdg-ninja"                # home dir cleaner
# brew "xxh"                      # ssh shell preservation
brew "yank"                     # terminal clipboard utility
brew "yazi"                     # terminal file manager
brew "zoxide"                   # cd replacement
brew "zsh"                      # updated z shell

################################################################
# desktop apps                                                 #
################################################################

cask "alacritty"                # terminal emulator
cask "arc"                      # web browser of the future
# cask "balenaetcher"             # boot drive imager
cask "bricklink-studio"         # lego designer
cask "discord"                  # digital communities
cask "duckduckgo"               # web browser
cask "firefox"                  # web browser
cask "hush"                     # safari content blocker
cask "keka"                     # archive handler
cask "kekaexternalhelper"       # keka helper
cask "logi-options-plus"        # logitech peripheral manager
cask "mactracker"               # apple product info
# cask "obs"                      # streaming suite
cask "obsidian"                 # markdown knowledge base
cask "proton-drive"             # secure cloud storage
cask "protonmail-bridge"        # proton.me local IMAP bridge
cask "protonvpn"                # secure vpn
# cask "raspberry-pi-imager"      # pi boot drive imager
cask "raycast", args: { require_sha: false } # spotlight replacement
cask "spotify", args: { require_sha: false } # music and podcasts
cask "stats"                    # menu bar system stats
cask "vscodium"                 # editor

################################################################
# software development                                         #
################################################################

brew "deno"                     # js runtime and tooling
brew "exercism"                 # coding exercise cli
brew "gh"                       # github cli
brew "go"                       # golang
# brew "gradle"                   # java build tool
# cask "hoppscotch"               # rest client
cask "httpie"                   # rest client
brew "hurl"                     # cli rest client and test suite
cask "linear-linear"            # issue tracker
brew "oven-sh/bun/bun"          # js runtime and tooling
brew "pkgxdev/made/pkgx"        # everything runner
brew "podman"                   # container cli
cask "podman-desktop"           # container client
# brew "postgresql"               # postgres DB
brew "pre-commit"               # git hook manager
brew "pyenv"                    # python version manager
brew "rustup-init"              # rust toolchain installer
brew "scc"                      # lines of code counter
cask "temurin"                  # jdk
# cask "vagrant"                  # virtual env manager
# brew "vercel-cli"               # deployments and hosting

################################################################
# fonts                                                        #
################################################################

cask "font-anonymous-pro"
cask "font-anonymice-nerd-font"
# cask "font-cascadia-code"
# cask "font-caskaydia-cove-nerd-font"
# cask "font-fira-code"
# cask "font-fira-code-nerd-font"
cask "font-monocraft"
cask "font-monocraft-nerd-font"

################################################################
# games                                                        #
################################################################

# cask "clone-hero"               # guitar hero clone
brew "fabric-installer"         # minecraft mod loader
brew "ferium"                   # minecraft mod manager
cask "minecraft"                # minecraft launcher
cask "modrinth"                 # minecraft launcher & mod manager
brew "quilt-installer"          # minecraft mod loader
# cask "retroarch"                # game emulator launcher
cask "steam"                    # game marketplace and launcher

################################################################
# new additions (via "brew add")                               #
################################################################
