{
  "Comment.nvim": {
    "branch": "master"
  },
  "auto-session": {
    "branch": "main"
  },
  "blink.cmp": {
    "branch": "main"
  },
  "catppuccin": {
    "branch": "main"
  },
  "codeium.vim": {
    "branch": "main"
  },
  "fidget.nvim": {
    "branch": "main"
  },
  "flash.nvim": {
    "branch": "main"
  },
  "friendly-snippets": {
    "branch": "main"
  },
  "gitsigns.nvim": {
    "branch": "main"
  },
  "grapple.nvim": {
    "branch": "main"
  },
  "grug-far.nvim": {
    "branch": "main"
  },
  "lazy.nvim": {
    "branch": "main"
  },
  "lazydev.nvim": {
    "branch": "main"
  },
  "lazygit.nvim": {
    "branch": "main"
  },
  "lualine.nvim": {
    "branch": "master"
  },
  "nvim-autopairs": {
    "branch": "master"
  },
  "nvim-cmp": {
    "branch": "main"
  },
  "nvim-lspconfig": {
    "branch": "master"
  },
  "nvim-treesitter": {
    "branch": "master"
  },
  "nvim-treesitter-textobjects": {
    "branch": "master"
  },
  "obsidian.nvim": {
    "branch": "main"
  },
  "peek.nvim": {
    "branch": "master"
  },
  "plenary.nvim": {
    "branch": "master"
  },
  "precognition.nvim": {
    "branch": "main"
  },
  "telescope-cmdline.nvim": {
    "branch": "main"
  },
  "telescope-fzf-native.nvim": {
    "branch": "main"
  },
  "telescope.nvim": {
    "branch": "master"
  },
  "todo-comments.nvim": {
    "branch": "main"
  },
  "trouble.nvim": {
    "branch": "main"
  },
  "vim-illuminate": {
    "branch": "master"
  },
  "vim-surround": {
    "branch": "master"
  },
  "which-key.nvim": {
    "branch": "main"
  },
  "yazi.nvim": {
    "branch": "master"
  }
}
