aaron-bond.better-comments
bierner.markdown-preview-github-styles
bungcip.better-toml
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
davidanson.vscode-markdownlint
esbenp.prettier-vscode
golang.go
gruntfuggly.todo-tree
ibm.output-colorizer
mechatroner.rainbow-csv
ms-python.python
rust-lang.rust-analyzer
serayuzgur.crates
shardulm94.trailing-spaces
unifiedjs.vscode-mdx
vscodevim.vim
yzhang.markdown-all-in-one
