aaron-bond.better-comments
astro-build.astro-vscode
bierner.markdown-preview-github-styles
bradlc.vscode-tailwindcss
bungcip.better-toml
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
csstools.postcss
davidanson.vscode-markdownlint
dotjoshjohnson.xml
eamodio.gitlens
esbenp.prettier-vscode
github.github-vscode-theme
gruntfuggly.todo-tree
hamza-aziane.obsidian-dark
ibm.output-colorizer
kevinrose.vsc-python-indent
leonardssh.vscord
mechatroner.rainbow-csv
ms-python.python
njpwerner.autodocstring
oven.bun-vscode
rust-lang.rust-analyzer
serayuzgur.crates
shardulm94.trailing-spaces
skellock.just
tauri-apps.tauri-vscode
unifiedjs.vscode-mdx
usernamehw.errorlens
vue.volar
yzhang.markdown-all-in-one
