aaron-bond.better-comments
astro-build.astro-vscode
bierner.markdown-preview-github-styles
bradlc.vscode-tailwindcss
bungcip.better-toml
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
codeium.codeium
davidanson.vscode-markdownlint
dotjoshjohnson.xml
eamodio.gitlens
esbenp.prettier-vscode
golang.go
gruntfuggly.todo-tree
hbenl.test-adapter-converter
hbenl.vscode-test-explorer
ibm.output-colorizer
leonardssh.vscord
mechatroner.rainbow-csv
ms-python.python
njpwerner.autodocstring
rust-lang.rust-analyzer
serayuzgur.crates
shardulm94.trailing-spaces
skellock.just
unifiedjs.vscode-mdx
usernamehw.errorlens
vscodevim.vim
yzhang.markdown-all-in-one
