# ------------------------------------------------------------ #
# Brewfile - macOS package installation via homebrew           #
# ------------------------------------------------------------ #

# terminal apps and packages --------------------------------- #

brew "aliae"                          # shell manager
brew "bash"                           # updated bash
brew "bitwarden-cli"                  # password manager
brew "eza"                            # ls replacement
brew "fd"                             # find alternative
brew "fish"                           # a fun shell
brew "fzf"                            # fuzzy finder
brew "git"                            # version controller
brew "jq"                             # json processor
brew "lazygit"                        # git client
brew "mpd"                            # music player daemon
brew "neovim"                         # text editor
brew "anomalyco/tap/opencode"         # ai coding agent
brew "presenterm"                     # markdown presenter
brew "ripgrep"                        # grep alternative
brew "rmpc"                           # music player
brew "boldandbrad/tap/slinky"         # dotfile manager
brew "starship"                       # shell prompt engine
brew "tmux"                           # terminal multiplexer
brew "zoxide"                         # cd replacement
brew "zsh"                            # updated zsh

# desktop apps ----------------------------------------------- #

cask "nikitabobko/tap/aerospace"      # tiling window manager
# cask "audacity"                       # audio toolkit
cask "bitwarden"                      # password manager
# cask "bricklink-studio"               # lego moc designer
cask "discord"                        # digital community client
cask "ghostty"                        # terminal emulator
# cask "hey-desktop"                    # email client
cask "obsidian"                       # note manager
brew "FelixKratz/formulae/sketchybar" # menubar replacement
cask "tidal"                          # music streamer
cask "mikker/tap/tuna"                # modal launcher
cask "zed"                            # text editor

# software development tooling and apps ---------------------- #

brew "deno"                     # js runtime & toolchain
brew "gh"                       # cli github client
brew "go"                       # go compiler & toolchain
brew "lefthook"                 # git hook manager
brew "lua"                      # lua language
brew "lua-language-server"      # lua language server
brew "marksman"                 # markdown lsp
brew "rbenv"                    # ruby version manager
brew "resterm"                  # http client
brew "rustup"                   # rust toolchain installer
brew "taplo"                    # toml toolchain
cask "temurin"                  # java development kit
brew "tokei"                    # code line counter

# fonts ------------------------------------------------------ #

# cask "font-anonymous-pro"
# cask "font-cascadia-code"
# cask "font-fira-code"
# cask "font-maple-mono"
cask "font-space-mono"

# games ------------------------------------------------------ #

cask "hytale"                   # official hytale launcher
cask "minecraft"                # official minecraft launcher
# cask "retroarch"                # game emulator launcher
cask "steam"                    # game marketplace and launcher

# new additions (via "brew bundle add") ---------------------- #
