# ------------------------------------------------------------ #
# Brewfile - macOS package installation via homebrew           #
# ------------------------------------------------------------ #

# taps ------------------------------------------------------- #

# tap "boldandbrad/tap"           # stuff made by me :)
tap "FelixKratz/formulae"       # sketchybar

# terminal apps and packages --------------------------------- #

brew "aliae"                    # cross platform shell manager
brew "bash"                     # system bash replacement
brew "bat"                      # cat replacement
brew "bitwarden-cli"            # password manager
brew "eza"                      # ls replacement
brew "fd"                       # find alternative
brew "fzf"                      # fuzzy finder
brew "git"                      # version control system
brew "jq"                       # json processor
brew "lazygit"                  # git client
brew "neovim"                   # text editor
brew "oh-my-posh"               # cross-shell prompt engine
brew "ripgrep"                  # grep alternative
brew "zoxide"                   # cd replacement
brew "zsh"                      # system zsh replacement

# desktop apps ----------------------------------------------- #

cask "bitwarden"                # password manager
# cask "bricklink-studio"         # lego moc designer
cask "discord"                  # digital community client
cask "ghostty"                  # terminal emulator
cask "leader-key"               # leader key based launcher
cask "raycast", args: { require_sha: false } # spotlight replacement
brew "sketchybar"               # menubar replacement
cask "spotify", args: { require_sha: false } # audio streamer
cask "wezterm"                  # terminal emulator
cask "zed"                      # text editor

# software development tooling and apps ---------------------- #

brew "deno"                     # js/ts runtime & toolchain
brew "gh"                       # cli github client
brew "go"                       # golang compiler & toolchain
brew "lefthook"                 # git hook manager
brew "lua"                      # lua language
brew "lua-language-server"      # lua_ls protocol
brew "marksman"                 # markdown lsp
brew "rbenv"                    # ruby version manager
brew "ruff"                     # python linter and formatter
brew "rustup"                   # rust toolchain installer
brew "taplo"                    # toml toolchain
cask "temurin"                  # java development kit
brew "tokei"                    # code line counter
brew "uv"                       # python package manager
cask "yaak"                     # desktop http client

# fonts ------------------------------------------------------ #

# cask "font-anonymous-pro"
# cask "font-anonymice-nerd-font"
# cask "font-cascadia-code"
# cask "font-caskaydia-cove-nerd-font"
# cask "font-fira-code"
# cask "font-fira-code-nerd-font"
# cask "font-maple-mono"
# cask "font-maple-mono-nf"
cask "font-space-mono"
cask "font-space-mono-nerd-font"

# games ------------------------------------------------------ #

cask "minecraft"                # minecraft launcher
# cask "retroarch"                # game emulator launcher
cask "steam"                    # game marketplace and launcher

# new additions (via "brew bundle add") ---------------------- #
