aaron-bond.better-comments
astro-build.astro-vscode
bierner.markdown-preview-github-styles
bradlc.vscode-tailwindcss
bungcip.better-toml
Catppuccin.catppuccin-vsc-icons
csstools.postcss
DavidAnson.vscode-markdownlint
esbenp.prettier-vscode
GitHub.github-vscode-theme
Gruntfuggly.todo-tree
Hamza-Aziane.obsidian-dark
IBM.output-colorizer
KevinRose.vsc-python-indent
LeonardSSH.vscord
mechatroner.rainbow-csv
ms-python.black-formatter
ms-python.python
njpwerner.autodocstring
oven.bun-vscode
rust-lang.rust-analyzer
shardulm94.trailing-spaces
skellock.just
tauri-apps.tauri-vscode
unifiedjs.vscode-mdx
usernamehw.errorlens
Vue.volar
yzhang.markdown-all-in-one
