bierner.markdown-preview-github-styles
bradlc.vscode-tailwindcss
bungcip.better-toml
csstools.postcss
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
denoland.vscode-deno
GitHub.github-vscode-theme
Gruntfuggly.todo-tree
Hamza-Aziane.obsidian-dark
IBM.output-colorizer
icrawl.discord-vscode
KevinRose.vsc-python-indent
lukashass.volar
mechatroner.rainbow-csv
mrmlnc.vscode-duplicate
ms-python.python
nick-rudenko.back-n-forth
njpwerner.autodocstring
radiolevity.neofloss
ritwickdey.LiveServer
rust-lang.rust-analyzer
shardulm94.trailing-spaces
skellock.just
theo-coder.the-best-theme
usernamehw.errorlens
withfig.fig
yzhang.markdown-all-in-one
